-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2021-11-27 23:16:40
-- 服务器版本： 8.0.12
-- PHP 版本： 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `classroom`
--

-- --------------------------------------------------------

--
-- 表的结构 `compuet`
--

CREATE TABLE `compuet` (
  `id` int(11) NOT NULL COMMENT '编号',
  `student_id` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT '学生号',
  `compuet_id` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT '电脑编号'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `curriculum`
--

CREATE TABLE `curriculum` (
  `id` int(11) NOT NULL COMMENT '编号',
  `week_id` varchar(50) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '星期',
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '课程名',
  `class` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '班级',
  `start_timer` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '开始时间',
  `end_timer` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '结束时间'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_croatian_ci;

--
-- 转存表中的数据 `curriculum`
--

INSERT INTO `curriculum` (`id`, `week_id`, `name`, `class`, `start_timer`, `end_timer`) VALUES
(1, '星期一', '大学英语', '软件一班', '08:10', '08:55'),
(2, '星期一', '大学英语', '软件一班', '09:05', '09:55'),
(3, '星期一', '基础', '软件一班', '10:10', '10:55'),
(4, '星期一', '基础', '软件一班', '11:05', '11:50'),
(5, '星期一', 'java程序设计', '软件一班', '14:30', '15:15'),
(6, '星期一', 'java程序设计', '软件一班', '15:25', '16:10'),
(7, '星期一', 'java程序设计', '软件一班', '16:20', '18:00'),
(8, '星期一', '形势', '软件一班', '19:30', '21:10'),
(17, '星期三', '计算机网络基础', '软件一班', '08:10', '08:55'),
(10, '星期二', '网页设计', '软件一班', '08:10', '08:55'),
(11, '星期二', '网页设计', '软件一班', '09:05', '09:50'),
(12, '星期二', '网页设计', '软件一班', '10:10', '10:55'),
(13, '星期二', '网页设计', '软件一班', '11:05', '11:50'),
(14, '星期二', '心里健康', '软件一班', '14:30', '15:15'),
(15, '星期二', '心理健康', '软件一班', '15:25', '16:10'),
(16, '星期二', '概论', '软件一班', '16:20', '18:00'),
(18, '星期三', '计算机网络基础', '软件一班', '09:05', '09:50'),
(19, '星期三', '计算机网络基础', '软件一班', '10:10', '10:55'),
(20, '星期三', '计算机网络基础', '软件一班', '11:05', '11:50'),
(21, '星期三', '大学英语', '软件一班', '14:30', '15:15'),
(22, '星期三', '大学英语', '软件一班', '15:25', '16:10'),
(23, '星期三', '计算机数学', '软件一班', '16:20', '18:00'),
(24, '星期三', '军事理论', '软件一班', '19:30', '21:10'),
(25, '星期四', 'java程序设计', '软件一班', '08:10', '08:55'),
(26, '星期四', 'java程序设计', '软件一班', '09:05', '09:50'),
(27, '星期四', '体育', '软件一班', '10:10', '10:55'),
(28, '星期四', '体育', '软件一班', '11:05', '11:50'),
(29, '星期五', '数据库原理与应用', '软件一班', '08:10', '08:55'),
(30, '星期五', '数据库原理与应用', '软件一班', '09:05', '09:50'),
(31, '星期五', '数据库原理与应用', '软件一班', '10:10', '10:55'),
(32, '星期五', '数据库原理与应用', '软件一班', '11:05', '11:50'),
(33, '星期一', '体育', '影视一班', '08:20', '08:55'),
(34, '星期一', '体育', '影视一班', '09:05', '09:50'),
(35, '星期一', '大学英语', '影视一班', '10:05', '10:55'),
(36, '星期一', '大学英语', '影视一班', '11:05', '11:50'),
(37, '星期一', '美术造型基础2', '影视一班', '14:30', '15:15'),
(38, '星期一', '美术造型', '影视一班', '15:25', '16:10'),
(39, '星期一', '美术造型', '影视一班', '16:20', '18:00'),
(40, '星期二', '视界设计项目', '影视一班', '08:20', '08:55'),
(41, '星期二', '体育', '影视一班', '09:05', '09:50'),
(42, '星期二', '视界设计项目', '影视一班', '10:05', '10:55'),
(43, '星期二', '视界设计项目', '影视一班', '11:05', '11:50'),
(44, '星期二', '三维基础', '影视一班', '14:30', '15:15'),
(45, '星期二', '三维基础', '影视一班', '15:25', '16:10'),
(46, '星期二', '三维基础', '影视一班', '16:20', '18:00'),
(47, '星期三', '心理健康', '影视一班', '08:20', '08:55'),
(48, '星期三', '心理健康', '影视一班', '09:05', '09:50'),
(49, '星期三', '体育', '影视一班', '10:05', '10:55'),
(50, '星期三', '体育', '影视一班', '11:05', '11:50'),
(51, '星期三', '项目实训', '影视一班', '14:30', '15:15'),
(52, '星期三', '项目实训', '影视一班', '15:25', '16:10'),
(53, '星期三', '项目实训', '影视一班', '16:20', '18:00'),
(54, '星期三', '形势', '影视一班', '19:30', '21:10'),
(55, '星期四', '动画基础', '影视一班', '08:20', '08:55'),
(56, '星期四', '动画基础', '影视一班', '09:05', '09:50'),
(57, '星期四', '动画基础', '影视一班', '10:05', '10:55'),
(58, '星期四', '动画基础', '影视一班', '11:05', '11:50'),
(59, '星期四', '项目实训', '影视一班', '14:30', '15:15'),
(60, '星期四', '项目实训', '影视一班', '15:25', '16:10'),
(61, '星期四', '项目实训', '影视一班', '16:20', '18:00'),
(62, '星期五', '大学英语', '影视一班', '08:20', '08:55'),
(63, '星期五', '大学英语', '影视一班', '09:05', '09:50'),
(64, '星期五', '大学英语', '影视一班', '10:05', '10:55'),
(65, '星期五', '大学英语', '影视一班', '11:05', '11:50'),
(66, '星期五', '项目实训', '影视一班', '14:30', '15:15'),
(67, '星期五', '项目实训', '影视一班', '15:25', '16:10'),
(68, '星期五', '项目实训', '影视一班', '16:20', '18:00'),
(69, '星期五', '军事理论', '影视一班', '19:30', '21:10'),
(70, '星期一', '网页设计（HTML5+CSS3）', '软件二班', '08:10', '08:55'),
(71, '星期一', '网页设计（HTML5+CSS3）', '软件二班', '09:05', '09:55'),
(72, '星期一', '网页设计（HTML5+CSS3）', '软件二班', '10:10', '10:55'),
(73, '星期一', '网页设计（HTML5+CSS3）', '软件二班', '11:05', '11:50'),
(74, '星期二', 'C语言程序设计', '软件二班', '14:30', '15:15'),
(75, '星期二', 'C语言程序设计', '软件二班', '15:25', '16:10'),
(76, '星期二', 'C语言程序设计', '软件二班', '16:20', '17:05'),
(77, '星期二', 'C语言程序设计', '软件二班', '17:15', '18:00'),
(78, '星期三', '商务礼仪', '软件二班', '14:30', '15:15'),
(79, '星期三', '商务礼仪', '软件二班', '15:25', '16:10'),
(80, '星期三', '商务礼仪', '软件二班', '16:20', '17:05'),
(81, '星期三', '商务礼仪', '软件二班', '17:15', '18:00'),
(82, '星期四', '办公软件应用', '软件二班', '08:10', '08:55'),
(83, '星期四', '办公软件应用', '软件二班', '09:05', '09:55'),
(84, '星期四', '办公软件应用', '软件二班', '10:10', '10:55'),
(85, '星期四', '办公软件应用', '软件二班', '11:05', '11:50'),
(86, '星期五', '计算机网络基础', '软件二班', '14:30', '15:15'),
(87, '星期五', '计算机网络基础', '软件二班', '15:25', '16:10'),
(88, '星期五', '计算机网络基础', '软件二班', '16:20', '17:05'),
(89, '星期五', '计算机网络基础', '软件二班', '17:15', '18:00'),
(90, '星期一', '电商数据分析', '电商一班', '14:30', '15:15'),
(91, '星期一', '电商数据分析', '电商一班', '15:25', '16:10'),
(92, '星期一', '电商数据分析', '电商一班', '16:20', '17:05'),
(93, '星期一', '电商数据分析', '电商一班', '17:15', '18:00'),
(94, '星期二', '网络营销', '电商一班', '08:10', '08:55'),
(95, '星期二', '网络营销', '电商一班', '09:05', '09:55'),
(96, '星期二', '网络营销', '电商一班', '10:10', '10:55'),
(97, '星期二', '网络营销', '电商一班', '11:05', '11:50'),
(98, '星期三', '视觉营销', '电商一班', '14:30', '15:15'),
(99, '星期三', '视觉营销', '电商一班', '15:25', '16:10'),
(100, '星期三', '视觉营销', '电商一班', '16:20', '17:05'),
(101, '星期三', '视觉营销', '电商一班', '17:15', '18:00'),
(102, '星期四', '平面设计', '电商一班', '14:30', '15:15'),
(103, '星期四', '平面设计', '电商一班', '15:25', '16:10'),
(104, '星期四', '平面设计', '电商一班', '16:20', '17:05'),
(105, '星期四', '平面设计', '电商一班', '17:15', '18:00'),
(106, '星期五', '大学英语', '电商一班', '14:30', '15:15'),
(107, '星期五', '大学英语', '电商一班', '15:25', '16:10'),
(108, '星期五', '大学英语', '电商一班', '16:20', '17:05'),
(109, '星期五', '大学英语', '电商一班', '17:15', '18:00'),
(110, '星期一', '大学英语', '电商二班', '08:10', '08:55'),
(111, '星期一', '大学英语', '电商二班', '09:05', '09:55'),
(112, '星期一', '大学英语', '电商二班', '10:10', '10:55'),
(113, '星期一', '大学英语', '电商二班', '11:05', '11:50'),
(114, '星期二', '平面设计', '电商二班', '08:10', '08:55'),
(115, '星期二', '平面设计', '电商二班', '09:05', '09:55'),
(116, '星期二', '平面设计', '电商二班', '10:10', '10:55'),
(117, '星期二', '平面设计', '电商二班', '11:05', '11:50'),
(118, '星期三', '电商数据分析', '电商二班', '14:30', '15:15'),
(119, '星期三', '电商数据分析', '电商二班', '15:25', '16:10'),
(120, '星期三', '电商数据分析', '电商二班', '16:20', '17:05'),
(121, '星期三', '电商数据分析', '电商二班', '17:15', '18:00'),
(122, '星期四', '视觉营销', '电商二班', '08:10', '08:55'),
(123, '星期四', '视觉营销', '电商二班', '09:05', '09:55'),
(124, '星期四', '视觉营销', '电商二班', '10:10', '10:55'),
(125, '星期四', '视觉营销', '电商二班', '11:05', '11:50'),
(126, '星期五', '网络营销', '电商二班', '14:30', '15:15'),
(127, '星期五', '网络营销', '电商二班', '15:25', '16:10'),
(128, '星期五', '网络营销', '电商二班', '16:20', '17:05'),
(129, '星期五', '网络营销', '电商二班', '17:15', '18:00'),
(130, '星期一', '平面设计', '计算机应用一班', '14:30', '15:15'),
(131, '星期一', '平面设计', '计算机应用一班', '15:25', '16:10'),
(132, '星期一', '平面设计', '计算机应用一班', '16:20', '17:05'),
(133, '星期一', '平面设计', '计算机应用一班', '17:15', '18:00'),
(134, '星期二', '商务礼仪', '计算机应用一班', '14:30', '15:15'),
(135, '星期二', '商务礼仪', '计算机应用一班', '15:25', '16:10'),
(136, '星期二', '商务礼仪', '计算机应用一班', '16:20', '17:05'),
(137, '星期二', '商务礼仪', '计算机应用一班', '17:15', '18:00'),
(138, '星期三', 'Java程序设计', '计算机应用一班', '14:30', '15:15'),
(139, '星期三', 'Java程序设计', '计算机应用一班', '15:25', '16:10'),
(140, '星期三', 'Java程序设计', '计算机应用一班', '16:20', '17:05'),
(141, '星期三', 'Java程序设计', '计算机应用一班', '17:15', '18:00'),
(142, '星期四', '数据库原理与应用', '计算机应用一班', '08:10', '08:55'),
(143, '星期四', '数据库原理与应用', '计算机应用一班', '09:05', '09:55'),
(144, '星期四', '数据库原理与应用', '计算机应用一班', '10:10', '10:55'),
(145, '星期四', '数据库原理与应用', '计算机应用一班', '11:05', '11:50'),
(146, '星期五', '职业素养', '计算机应用一班', '14:30', '15:15'),
(147, '星期五', '职业素养', '计算机应用一班', '15:25', '16:10'),
(148, '星期五', '职业素养', '计算机应用一班', '16:20', '17:05'),
(149, '星期五', '职业素养', '计算机应用一班', '17:15', '18:00'),
(150, '星期一', 'Java程序设计', '计算机应用二班', '08:10', '08:55'),
(151, '星期一', 'Java程序设计', '计算机应用二班', '09:05', '09:55'),
(152, '星期一', 'Java程序设计', '计算机应用二班', '10:10', '10:55'),
(153, '星期一', 'Java程序设计', '计算机应用二班', '11:05', '11:50'),
(154, '星期二', '平面设计', '计算机应用二班', '14:30', '15:15'),
(155, '星期二', '平面设计', '计算机应用二班', '15:25', '16:10'),
(156, '星期二', '平面设计', '计算机应用二班', '16:20', '17:05'),
(157, '星期二', '平面设计', '计算机应用二班', '17:15', '18:00'),
(158, '星期三', '数据库原理与应用', '计算机应用二班', '14:30', '15:15'),
(159, '星期三', '数据库原理与应用', '计算机应用二班', '15:25', '16:10'),
(160, '星期三', '数据库原理与应用', '计算机应用二班', '16:20', '17:05'),
(161, '星期三', '数据库原理与应用', '计算机应用二班', '17:15', '18:00'),
(162, '星期四', '职业素养', '计算机应用二班', '08:10', '08:55'),
(163, '星期四', '职业素养', '计算机应用二班', '09:05', '09:55'),
(164, '星期四', '职业素养', '计算机应用二班', '10:10', '10:55'),
(165, '星期四', '职业素养', '计算机应用二班', '11:05', '11:50'),
(166, '星期五', '商务礼仪', '计算机应用二班', '14:30', '15:15'),
(167, '星期五', '商务礼仪', '计算机应用二班', '15:25', '16:10'),
(168, '星期五', '商务礼仪', '计算机应用二班', '16:20', '17:05'),
(169, '星期五', '商务礼仪', '计算机应用二班', '17:15', '18:00'),
(170, '星期一', '网页设计（HTML5+CSS3）', '计算机网络一班', '08:10', '08:55'),
(171, '星期一', '网页设计（HTML5+CSS3）', '计算机网络一班', '09:05', '09:55'),
(172, '星期一', '网页设计（HTML5+CSS3）', '计算机网络一班', '10:10', '10:55'),
(173, '星期一', '网页设计（HTML5+CSS3）', '计算机网络一班', '11:05', '11:50'),
(174, '星期二', 'C语言程序设计', '计算机网络一班', '14:30', '15:15'),
(175, '星期二', 'C语言程序设计', '计算机网络一班', '15:25', '16:10'),
(176, '星期二', 'C语言程序设计', '计算机网络一班', '16:20', '17:05'),
(177, '星期二', 'C语言程序设计', '计算机网络一班', '17:15', '18:00'),
(178, '星期三', '商务礼仪', '计算机网络一班', '08:10', '08:55'),
(179, '星期三', '商务礼仪', '计算机网络一班', '09:05', '09:55'),
(180, '星期三', '商务礼仪', '计算机网络一班', '10:10', '10:55'),
(181, '星期三', '商务礼仪', '计算机网络一班', '11:05', '11:50'),
(182, '星期四', '办公软件应用', '计算机网络一班', '14:30', '15:15'),
(183, '星期四', '办公软件应用', '计算机网络一班', '15:25', '16:10'),
(184, '星期四', '办公软件应用', '计算机网络一班', '16:20', '17:05'),
(185, '星期四', '办公软件应用', '计算机网络一班', '17:15', '18:00'),
(186, '星期五', '计算机网络基础', '计算机网络一班', '08:10', '08:55'),
(187, '星期五', '计算机网络基础', '计算机网络一班', '09:05', '09:55'),
(188, '星期五', '计算机网络基础', '计算机网络一班', '10:10', '10:55'),
(189, '星期五', '计算机网络基础', '计算机网络一班', '11:05', '11:50');

-- --------------------------------------------------------

--
-- 表的结构 `kaoh`
--

CREATE TABLE `kaoh` (
  `id` int(11) NOT NULL COMMENT '编号',
  `student_id` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '学号',
  `name` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '姓名',
  `class` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '班级',
  `kec` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '课程',
  `week` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '周数',
  `week_id` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '星期',
  `state` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '节数',
  `ztai` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '状态',
  `show_id` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_croatian_ci;

--
-- 转存表中的数据 `kaoh`
--

INSERT INTO `kaoh` (`id`, `student_id`, `name`, `class`, `kec`, `week`, `week_id`, `state`, `ztai`, `show_id`) VALUES
(44, '2019306208', '陈紫1', '软件二班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 8),
(43, '2019306208', '陈紫寒', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 8),
(42, '2019306207', '陈荣轩', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '迟到', 7),
(41, '2019306206', '陈鹏', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 6),
(40, '2019306205', '蔡嘉豪', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 5),
(39, '2019306204', '毕浩凯', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 4),
(38, '2019306203', '毕嘉豪', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 3),
(37, '2019306202', '毕忆柳', '软件一班', '数据库原理与应用', '第10周', '星期五', '第3节', '正常', 2),
(36, '2019306236', '林亚楠', '计算机应用一班', '职业素养', '第10周', '星期五', '第7节', '正常', 1),
(45, '2019306237', '蒋依芸', '计算机应用一班', '职业素养', '第10周', '星期五', '第7节', '正常', 2),
(46, '2019306238', '刘伯红', '计算机应用一班', '职业素养', '第10周', '星期五', '第7节', '正常', 3),
(47, '2019306239', '阮建安', '计算机应用一班', '职业素养', '第10周', '星期五', '第7节', '正常', 4);

-- --------------------------------------------------------

--
-- 表的结构 `students`
--

CREATE TABLE `students` (
  `id` int(11) NOT NULL COMMENT '编号',
  `username` varchar(20) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '账号',
  `password` varchar(20) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '密码',
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '姓名',
  `gender` varchar(50) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '性别',
  `class` varchar(150) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '班级',
  `student_id` varchar(20) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '学生号',
  `headmaster` varchar(100) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '班主任',
  `show_id` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_croatian_ci;

--
-- 转存表中的数据 `students`
--

INSERT INTO `students` (`id`, `username`, `password`, `name`, `gender`, `class`, `student_id`, `headmaster`, `show_id`) VALUES
(1, '2019306201', '123456', '白梦琪', '女', '软件一班', '2019306201', '芷文', 1),
(2, '2019306202', '123456', '毕忆柳', '女', '软件一班', '2019306202', '芷文', 2),
(3, '2019306203', '123456', '毕嘉豪', '男', '软件一班', '2019306203', '芷文', 3),
(4, '2019306204', '123456', '毕浩凯', '男', '软件一班', '2019306204', '芷文', 4),
(5, '2019306205', '123456', '蔡嘉豪', '男', '软件一班', '2019306205', '芷文', 5),
(6, '2019306206', '123456', '陈鹏', '男', '软件一班', '2019306205', '芷文', 6),
(7, '2019306207', '123456', '陈荣轩', '男', '软件一班', '2019306207', '芷文', 7),
(8, '2019306208', '123456', '陈紫寒', '女', '软件一班', '2019306208', '芷文', 8),
(9, '2019306209', '123456', '陈紫琪', '女', '软件二班', '2019306209', '梦寒', 1),
(10, '2019306210', '123456', '成裴玄', '男', '软件二班', '2019306210', '梦寒', 2),
(11, '2019306211', '123456', '邓麟', '男', '软件二班', '2019306211', '梦寒', 3),
(12, '2019306212', '123456', '邓琳', '女', '软件二班', '2019306212', '梦寒', 4),
(13, '2019306213', '123456', '杜淳', '男', '软件二班', '2019306213', '梦寒', 5),
(14, '2019306214', '123456', '杜永奇', '男', '软件二班', '2019306214', '梦寒', 6),
(15, '2019306215', '123456', '符元', '男', '软件二班', '2019306215', '梦寒', 7),
(16, '2019306216', '123456', '方大同', '男', '软件二班', '2019306216', '梦寒', 8),
(17, '2019306217', '123456', '关晓彤', '女', '软件二班', '2019306217', '梦寒', 9),
(18, '2019306218', '123456', '关子琪', '女', '电商一班', '2019306218', '友诚', 1),
(19, '2019306219', '123456', '江松霖', '男', '电商一班', '2019306219', '友诚', 2),
(20, '2019306220', '123456', '黄文豪', '男', '电商一班', '2019306220', '友诚', 3),
(21, '2019306221', '123456', '黄中柳', '男', '电商一班', '2019306221', '友诚', 4),
(22, '2019306222', '123456', '徐浩', '男', '电商一班', '2019306222', '友诚', 5),
(23, '2019306223', '123456', '徐昊', '男', '电商一班', '2019306223 ', '友诚', 6),
(24, '2019306224', '123456', '徐豪', '男', '电商一班', '2019306224', '友诚', 7),
(25, '2019306225', '123456', '魏无羡', '男', '电商一班', '2019306225', '友诚', 8),
(26, '2019306226', '123456', '魏琳', '女', '电商一班', '2019306225', '友诚', 9),
(27, '2019306227', '123456', '吴桐', '男', '计算机应用二班', '2019306226', '宏利', 1),
(28, '2019306228', '123456', '刘元香', '女', '计算机应用二班', '2019306227', '宏利', 2),
(29, '2019306229', '123456', '易鸣', '男', '计算机应用二班', '2019306228', '宏利', 3),
(30, '2019306230', '123456', '钟子欣', '女', '计算机应用二班', '2019306229', '宏利', 4),
(31, '2019306231', '123456', '郑杰明', '男', '计算机应用二班', '2019306230', '宏利', 5),
(32, '2019306232', '123456', '郑凯', '男', '计算机应用二班', '2019306226', '宏利', 6),
(33, '2019306233', '123456', '张吉淮', '男', '计算机应用二班', '2019306233', '宏利', 7),
(34, '2019306234', '123456', '林国瑞', '男', '计算机应用二班', '2019306234', '宏利', 8),
(35, '2019306235', '123456', '林文书', '男', '计算机应用二班', '2019306235', '宏利', 9),
(36, '2019306236', '123456', '林亚楠', '女', '计算机应用一班', '2019306236', '怜容', 1),
(37, '2019306237', '123456', '蒋依芸', '女', '计算机应用一班', '2019306237', '怜容', 2),
(38, '2019306238', '123456', '刘伯红', '女', '计算机应用一班', '2019306238', '怜容', 3),
(39, '2019306239', '123456', '阮建安', '男', '计算机应用一班', '2019306239', '怜容', 4),
(40, '2019306240', '123456', '林子凡', '男', '计算机应用一班', '2019306240', '怜容', 5),
(41, '2019306241', '123456', '夏志豪', '男', '计算机应用一班', '2019306241', '怜容', 6),
(42, '2019306242', '123456', '吉茹定', '男', '计算机应用一班', '2019306242', '怜容', 7),
(43, '2019306243', '123456', '李中冰', '女', '计算机应用一班', '2019306243', '怜容', 8),
(44, '2019306244', '123456', '黄文隆', '男', '计算机应用一班', '2019306244', '怜容', 9),
(45, '2019306245', '123456', '谢彦文', '男', '计算机网络一班', '2019306245', '慕凝', 1),
(46, '2019306246', '123456', '傅志翔', '男', '计算机网络一班', '2019306246', '慕凝', 2),
(47, '2019306247', '123456', '洪振霞', '女', '计算机网络一班', '2019306247', '慕凝', 3),
(48, '2019306248', '123456', '刘紫婷', '女', '计算机网络一班', '2019306248', '慕凝', 4),
(49, '2019306249', '123456', '荣子康', '男', '计算机网络一班', '2019306249', '慕凝', 5),
(50, '2019306250', '123456', '吕志英', '女', '计算机网络一班', '2019306250', '慕凝', 6),
(51, '2019306251', '123456', '方义强', '男', '计算机网络一班', '2019306251', '慕凝', 7),
(52, '2019306252', '123456', '郑怡雯', '女', '计算机网络一班', '2019306252', '慕凝', 8),
(53, '2019306253', '123456', '雷金宝', '男', '计算机网络一班', '2019306253', '慕凝', 9),
(54, '2019306254', '123456', '吴新振', '男', '影视一班', '2019306254', '蕙伦', 1),
(55, '2019306255', '123456', '王美珠', '女', '影视一班', '2019306255', '蕙伦', 2),
(56, '2019306256', '123456', '郭芳天', '男', '影视一班', '2019306256', '蕙伦', 3),
(57, '2019306257', '123456', '李亚辉', '男', '影视一班', '2019306257', '蕙伦', 4),
(58, '2019306258', '123456', '陈文婷', '女', '影视一班', '2019306258', '蕙伦', 5),
(59, '2019306259', '123456', '王怡婷', '女', '影视一班', '2019306259', '蕙伦', 6),
(60, '2019306260', '123456', '吴美玉', '女', '影视一班', '2019306260', '蕙伦', 7),
(61, '2019306261', '123456', '陆慕', '男', '影视一班', '2019306261', '蕙伦', 8),
(62, '2019306262', '123456', '卢木仲', '男', '影视一班', '2019306262', '蕙伦', 9),
(63, '2019306263', '123456', '林嘉伦', '男', '电商二班', '2019306263', '秋荷', 1),
(64, '2019306264', '123456', '张洪林', '男', '电商二班', '2019306264', '秋荷', 2),
(65, '2019306265', '123456', '叶杰启', '男', '电商二班', '2019306265', '秋荷', 3),
(66, '2019306266', '123456', '王依乐', '女', '电商二班', '2019306266', '秋荷', 4),
(67, '2019306267', '123456', '王爱乐', '女', '电商二班', '2019306267', '秋荷', 5),
(68, '2019306268', '123456', '陈洪荣', '男', '电商二班', '2019306268', '秋荷', 6),
(69, '2019306269', '123456', '陈苏达', '男', '电商二班', '2019306269', '秋荷', 7),
(70, '2019306270', '123456', '夏雅慧', '女', '电商二班', '2019306270', '秋荷', 8),
(71, '2019306271', '123456', '金家荣', '男', '电商二班', '2019306271', '秋荷', 9);

-- --------------------------------------------------------

--
-- 表的结构 `teachers`
--

CREATE TABLE `teachers` (
  `id` int(11) NOT NULL COMMENT '编号',
  `username` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '账号',
  `password` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '密码',
  `teacher_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '姓名',
  `of_class` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '所教班级',
  `class_kec` varchar(200) CHARACTER SET utf8 COLLATE utf8_croatian_ci NOT NULL COMMENT '所教课程'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_croatian_ci;

--
-- 转存表中的数据 `teachers`
--

INSERT INTO `teachers` (`id`, `username`, `password`, `teacher_name`, `of_class`, `class_kec`) VALUES
(1, '1001001', '123456', '李彤彤', '软件一班', '大学英语'),
(2, '1001001', '123456', '李彤彤', '影视一班', '大学英语'),
(3, '1001002', '123456', '陈世强', '软件一班', '军事理论'),
(4, '1001002', '123456', '陈世强', '影视一班', '军事理论'),
(5, '1001003', '123456', '邓中宏', '影视一班', '动画基础'),
(6, '1001003', '123456', '邓中宏', '软件一班', 'java程序设计'),
(7, '1001004', '123456', '田忠', '电商二班', '网络营销'),
(9, '1001004', '123456', '田忠', '软件二班', '网页设计'),
(10, '1001005', '123456', '钟士', '软件一班', '数据库原理与应用'),
(11, '1001005', '123456', '钟士', '影视一班', '三维基础'),
(12, '1001006', '123456', '玖玖', '计算机应用一班', '职业素养'),
(13, '1001006', '123456', '玖玖', '计算机应用二班', '职业素养');

--
-- 转储表的索引
--

--
-- 表的索引 `compuet`
--
ALTER TABLE `compuet`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `curriculum`
--
ALTER TABLE `curriculum`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `kaoh`
--
ALTER TABLE `kaoh`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `compuet`
--
ALTER TABLE `compuet`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号';

--
-- 使用表AUTO_INCREMENT `curriculum`
--
ALTER TABLE `curriculum`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号', AUTO_INCREMENT=191;

--
-- 使用表AUTO_INCREMENT `kaoh`
--
ALTER TABLE `kaoh`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号', AUTO_INCREMENT=48;

--
-- 使用表AUTO_INCREMENT `students`
--
ALTER TABLE `students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号', AUTO_INCREMENT=77;

--
-- 使用表AUTO_INCREMENT `teachers`
--
ALTER TABLE `teachers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号', AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
